Tekla Open API Reference for Tekla Structures 2025
DPMPrinterAttributes.OutputType Property
 The printing output type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DotPrintOutputType OutputType { get; set; }
Public Property OutputType As DotPrintOutputType
	Get
	Set
Property Value
Type: DotPrintOutputType
See Also
Reference
DPMPrinterAttributes Class
Tekla.Structures.Drawing Namespace